In [37]:
# Pandas
import pandas as pd

# Matplotlib for the plots
import matplotlib.pyplot as plt 

#SQL Acchemy
from sqlalchemy import create_engine

In [38]:
# Connection to the Employee Database
engine = create_engine('postgresql://postgres:321@Junior!@localhost:5433/EmployeeSQL')
conn = engine.connect()

In [39]:
# Query employee data
employees = pd.read_sql('employees', conn)
employees.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [40]:
# Query salary data
salaries = pd.read_sql('salaries', conn)
salaries.head()

  emp_no  salary
0  10001   60117
1  10002   65828
2  10003   40006
3  10004   40054
4  10005   78228

In [ ]:
df = employees.merge(salaries)

In [50]:
salary_type = salaries[['emp_no', 'salary']].groupby(['salary']).count()
salary_type.head()

        emp_no
salary
40000    95346
40001        5
40002       10
40003        9
40004        9

In [43]:
# Query titles data
titles = pd.read_sql('titles', conn)
titles

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager